/**
 * 提供一个N计算值，比如N=8，计算8*7/6+5-4*3/2+1
 * 方法：
 * 1.N⋅(N-1)⋅(N-2)=N+1+2/(N-2)，而当N>4时，2/(N-2)等于0，即N⋅(N-1)⋅(N-2)=N+1
 * 2.当N>8时，(N−4)⋅(N−5)/(N−6)=N−3，即(N-3)-(N−4)⋅(N−5)/(N−6)=0
 * 3.所以当N>4时，可以讨论N%4的值，分别计算结果值；当N<=4时，直接计算N=1,2,3,4的值
 * 时间复杂度O(1)，空间复杂度O(1)
 */

var clumsy = function (N) {
  if (N === 1) {
    // 1
    return 1;
  } else if (N === 2) {
    // 2*1
    return 2;
  } else if (N === 3) {
    // 3*2/1
    return 6;
  } else if (N === 4) {
    // 4*3/2+1
    return 7;
  }

  if (N % 4 === 0) {
    // N⋅(N-1)/(N-2) + 5 - 4 * 3 / 2 + 1
    return N + 1;
  } else if (N % 4 <= 2) {
    // N % 4 === 1 》N⋅(N-1)/(N-2) + 6 - 5 * 4 / 3 + 2 - 1
    // N % 4 === 2 》N⋅(N-1)/(N-2) + 7 - 6 * 5 / 4 + 3 - 2 * 1
    return N + 2;
  } else {
    // N⋅(N-1)/(N-2) + 8 - 7 * 6 / 5 + 4 - 3 * 2 / 1
    return N - 1;
  }
};
